{
	"basics": {
		"name": "Yordi Castro Rojas",
		"label": "Informático Empresarial | FullStack | Experiencia en Desarrollo Web",
		"email": "jordycastro1756@gmail.com",
		"url": "https://jordy756-minimalist-portfolio.vercel.app/",
		"summary": "Desarrollador Full Stack con enfoque en tecnologías web modernas y 4 años de experiencia en proyectos académicos y profesionales. Especializado en el desarrollo de aplicaciones con arquitecturas limpias, microservicios y principios SOLID. Soy un apasionado del aprendizaje continuo y autodidacta, adaptándome rápidamente a nuevas tecnologías. Destaco por mi capacidad para trabajar en equipo en entornos ágiles, comunicar ideas técnicas de forma efectiva y entregar soluciones eficientes que cumplen tanto requisitos técnicos como necesidades del usuario final.",
		"location": {
			"city": "Turrialba, Cartago",
			"countryCode": "CR",
			"region": "Costa Rica"
		},
		"profiles": [
			{
				"network": "LinkedIn",
				"username": "Yordi Castro",
				"url": "https://linkedin.com/in/yordicastro"
			},
			{
				"network": "GitHub",
				"username": "Jordy1756",
				"url": "https://github.com/Jordy1756"
			}
		]
	},
	"works": [
		{
			"name": "Universidad de Costa Rica",
			"position": "Estudiante de Informática Empresarial Full Stack",
			"startDate": "2020-03-10",
			"endDate": null,
			"summary": "Estudiante de Informática Empresarial enfocado en desarrollo web Full Stack, aplicando arquitecturas avanzadas, bases de datos y diseño de interfaces en múltiples proyectos académicos.",
			"highlights": [
				"Diseñé una plataforma bancaria implementando arquitectura limpia con microservicios y principios SOLID.",
				"Implementé sistemas de autenticación y autorización utilizando JWT para gestión de usuarios y roles.",
				"Desarrollé APIs RESTful para integración con servicios externos y gestión eficiente de datos.",
				"Administré bases de datos SQL y NoSQL optimizando consultas y estructura para alto rendimiento.",
				"Implementé metodologías ágiles como Scrum en equipos de desarrollo colaborativo.",
				"Creé sistemas de diseño unificados para garantizar consistencia en interfaces de usuario.",
				"Desarrollé aplicaciones web responsivas con HTML, CSS y JavaScript optimizadas para diferentes dispositivos.",
				"Construí aplicaciones móviles con Ionic y Angular integrando funcionalidades nativas.",
				"Implementé ORMs como Entity Framework y Sequelize para optimizar la interacción con bases de datos.",
				"Creé una API que permite realizar operaciones CRUD mediante comandos de voz usando Alexa.",
				"Desarrollé aplicaciones de escritorio y juegos utilizando Java Swing y Graphics."
			]
		},
		{
			"name": "INTA Costa Rica",
			"position": "Programador Full Stack",
			"startDate": "2023-07-10",
			"endDate": "2023-12-01",
			"summary": "Desarrollé un sistema integral de gestión de inventario para el Instituto Nacional de Innovación y Transferencia en Tecnología Agropecuaria, cubriendo todas las etapas desde requisitos hasta implementación.",
			"highlights": [
				"Colaboré en sesiones de levantamiento de requisitos con stakeholders para definir alcance y funcionalidades.",
				"Diseñé la arquitectura del sistema, garantizando escalabilidad, mantenibilidad y seguridad.",
				"Desarrollé módulos frontend y backend utilizando Blazor y C#.",
				"Implementé y optimicé la estructura de base de datos en SQL Server con enfoque en integridad y rendimiento.",
				"Creé un sistema de gestión de usuarios con múltiples niveles de acceso y permisos granulares.",
				"Implementé pruebas unitarias y de integración automatizadas para garantizar calidad de código.",
				"Diseñé interfaz de usuario intuitiva y accesible siguiendo principios de UX/UI modernos.",
				"Configuré un sistema robusto de registro y monitoreo para facilitar la resolución de incidencias.",
				"Elaboré documentación técnica y guías de usuario para facilitar adopción y soporte.",
				"Ejecuté el despliegue en producción asegurando migración sin pérdida de datos y mínimo tiempo de inactividad."
			]
		},
		{
			"name": "Lácteos El Torito",
			"position": "Diseñador Web y Desarrollador",
			"startDate": "2024-01-01",
			"endDate": "2024-03-01",
			"summary": "Creé una landing page profesional para aumentar la presencia digital de la empresa, mejorar su visibilidad online y presentar su catálogo de productos lácteos de manera atractiva.",
			"highlights": [
				"Conduje entrevistas con el cliente para capturar los valores de marca y objetivos comerciales.",
				"Diseñé un sistema visual completo, incluyendo paleta de colores, tipografías y componentes UI coherentes con la identidad de marca.",
				"Desarrollé un sitio web de alto rendimiento utilizando Astro, CSS modular y JavaScript optimizado.",
				"Optimicé el rendimiento web logrando puntuaciones superiores a 90 en Google Lighthouse.",
				"Integré sistema de formularios con validación y conexión a servicios de email marketing.",
				"Desarrollé diseño responsivo garantizando experiencia óptima en todos los dispositivos."
			]
		}
	],
	"education": [
		{
			"institution": "Universidad de Costa Rica, Turrialba",
			"area": "Informática Empresarial",
			"startDate": "2020-03-10",
			"endDate": null
		}
	],
	"certificates": [
		{
			"name": "Oracle Next Education F2 T5 Front-end",
			"date": "2023-09-23",
			"issuer": "Oracle + Alura Latam",
			"url": "https://app.aluracursos.com/user/jordycastro1756/program/7/certificate"
		},
		{
			"name": "Oracle Next Education Completo",
			"date": "2024-02-12",
			"issuer": "Oracle + Alura Latam",
			"url": "https://app.aluracursos.com/user/jordycastro1756/fullCertificate/fb6c4059144a90dd07315ca00c5512cb"
		},
		{
			"name": "Scrum Fundamentals Certified (SFC)",
			"date": "2023-10-31",
			"issuer": "SCRUMstudy - Accreditation Body for Scrum and Agile",
			"url": "https://www.scrumstudy.com/certification/verify?type=SFC&number=1003121"
		}
	],
	"skills": [
		"HTML",
		"CSS",
		"JavaScript",
		"TypeScript",
		"Node JS",
		"Express",
		"C#",
		"MySQL",
		"SQL Server",
		"MongoDB",
		"Git",
		"GitHub",
		"React",
		"Astro",
		"Figma",
		"Clean Architecture",
		"Microservicios",
		"SOLID",
		"Scrum",
		"Design Systems",
		"Responsive Design",
		"Gateway API",
		"Middleware",
		"OAuth",
		"JWT"
	],
	"projects": [
		{
			"name": "Lácteos El Torito",
			"highlights": ["Astro", "TypeScript", "CSS", "Figma"],
			"description": "Landing page para empresa de productos lácteos.",
			"url": "https://lacteos-el-torito.vercel.app/",
			"github": "https://github.com/Jordy1756/el-torito-dairy-products.git"
		},
		{
			"name": "Silk Tree",
			"description": "Aplicación web para la gestión de citas médicas, usuarios y servicios del hospital.",
			"highlights": ["React", "Screaming Architecture", "TypeScript"],
			"url": "https://silk-tree.vercel.app/",
			"github": "https://github.com/Jordy1756/silk-tree"
		},
		{
			"name": "Silk Tree REST API",
			"description": "API REST para la gestión de citas médicas, usuarios y servicios del hospital.",
			"highlights": ["Node JS", "Express", "JWT", "MySQL"],
			"github": "https://github.com/Jordy1756/silk-tree-api.git"
		},
		{
			"name": "Hi Cupon REST API",
			"description": "API REST para la gestión de cupones y promociones, permitiendo a los usuarios obtener descuentos en productos y servicios.",
			"highlights": ["C#", "Clean Architecture", "SQL Server"],
			"github": "https://github.com/Jordy1756/HiCupon_API_NET.git"
		}
	]
}
